MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CZ2051CA80144/mcu.h
/* ************************************************************************** */
/*                    Event User IDs for C32CZ2051CA80144                     */
/* ************************************************************************** */
#define EVENT_ID_USER_FREQM_START                         0 /* ID for FREQM event user START */
#define EVENT_ID_USER_RTC_TAMPER                          1 /* ID for RTC event user TAMPER */
#define EVENT_ID_USER_PORT_EV_0                           2 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           3 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           4 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           5 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMA_CHSTRT_0                        6 /* ID for DMA event user CHSTRT_0 */
#define EVENT_ID_USER_DMA_CHSTRT_1                        7 /* ID for DMA event user CHSTRT_1 */
#define EVENT_ID_USER_DMA_CHSTRT_2                        8 /* ID for DMA event user CHSTRT_2 */
#define EVENT_ID_USER_DMA_CHSTRT_3                        9 /* ID for DMA event user CHSTRT_3 */
#define EVENT_ID_USER_DMA_CHSTRT_4                       10 /* ID for DMA event user CHSTRT_4 */
#define EVENT_ID_USER_DMA_CHSTRT_5                       11 /* ID for DMA event user CHSTRT_5 */
#define EVENT_ID_USER_DMA_CHSTRT_6                       12 /* ID for DMA event user CHSTRT_6 */
#define EVENT_ID_USER_DMA_CHSTRT_7                       13 /* ID for DMA event user CHSTRT_7 */
#define EVENT_ID_USER_DMA_CHSTRT_8                       14 /* ID for DMA event user CHSTRT_8 */
#define EVENT_ID_USER_DMA_CHSTRT_9                       15 /* ID for DMA event user CHSTRT_9 */
#define EVENT_ID_USER_DMA_CHSTRT_10                      16 /* ID for DMA event user CHSTRT_10 */
#define EVENT_ID_USER_DMA_CHSTRT_11                      17 /* ID for DMA event user CHSTRT_11 */
#define EVENT_ID_USER_DMA_CHSTRT_12                      18 /* ID for DMA event user CHSTRT_12 */
#define EVENT_ID_USER_DMA_CHSTRT_13                      19 /* ID for DMA event user CHSTRT_13 */
#define EVENT_ID_USER_DMA_CHSTRT_14                      20 /* ID for DMA event user CHSTRT_14 */
#define EVENT_ID_USER_DMA_CHSTRT_15                      21 /* ID for DMA event user CHSTRT_15 */
#define EVENT_ID_USER_DMA_CHAUX_0                        22 /* ID for DMA event user CHAUX_0 */
#define EVENT_ID_USER_DMA_CHAUX_1                        23 /* ID for DMA event user CHAUX_1 */
#define EVENT_ID_USER_DMA_CHAUX_2                        24 /* ID for DMA event user CHAUX_2 */
#define EVENT_ID_USER_DMA_CHAUX_3                        25 /* ID for DMA event user CHAUX_3 */
#define EVENT_ID_USER_DMA_CHAUX_4                        26 /* ID for DMA event user CHAUX_4 */
#define EVENT_ID_USER_DMA_CHAUX_5                        27 /* ID for DMA event user CHAUX_5 */
#define EVENT_ID_USER_DMA_CHAUX_6                        28 /* ID for DMA event user CHAUX_6 */
#define EVENT_ID_USER_DMA_CHAUX_7                        29 /* ID for DMA event user CHAUX_7 */
#define EVENT_ID_USER_DMA_CHAUX_8                        30 /* ID for DMA event user CHAUX_8 */
#define EVENT_ID_USER_DMA_CHAUX_9                        31 /* ID for DMA event user CHAUX_9 */
#define EVENT_ID_USER_DMA_CHAUX_10                       32 /* ID for DMA event user CHAUX_10 */
#define EVENT_ID_USER_DMA_CHAUX_11                       33 /* ID for DMA event user CHAUX_11 */
#define EVENT_ID_USER_DMA_CHAUX_12                       34 /* ID for DMA event user CHAUX_12 */
#define EVENT_ID_USER_DMA_CHAUX_13                       35 /* ID for DMA event user CHAUX_13 */
#define EVENT_ID_USER_DMA_CHAUX_14                       36 /* ID for DMA event user CHAUX_14 */
#define EVENT_ID_USER_DMA_CHAUX_15                       37 /* ID for DMA event user CHAUX_15 */
#define EVENT_ID_USER_TCC0_EV_0                          38 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          39 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          40 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          41 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          42 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          43 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC0_MC_4                          44 /* ID for TCC0 event user MC_4 */
#define EVENT_ID_USER_TCC0_MC_5                          45 /* ID for TCC0 event user MC_5 */
#define EVENT_ID_USER_TCC0_MC_6                          46 /* ID for TCC0 event user MC_6 */
#define EVENT_ID_USER_TCC0_MC_7                          47 /* ID for TCC0 event user MC_7 */
#define EVENT_ID_USER_TCC1_EV_0                          48 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          49 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          50 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          51 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC1_MC_2                          52 /* ID for TCC1 event user MC_2 */
#define EVENT_ID_USER_TCC1_MC_3                          53 /* ID for TCC1 event user MC_3 */
#define EVENT_ID_USER_TCC1_MC_4                          54 /* ID for TCC1 event user MC_4 */
#define EVENT_ID_USER_TCC1_MC_5                          55 /* ID for TCC1 event user MC_5 */
#define EVENT_ID_USER_TCC1_MC_6                          56 /* ID for TCC1 event user MC_6 */
#define EVENT_ID_USER_TCC1_MC_7                          57 /* ID for TCC1 event user MC_7 */
#define EVENT_ID_USER_TCC2_EV_0                          58 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          59 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          60 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          61 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TCC2_MC_2                          62 /* ID for TCC2 event user MC_2 */
#define EVENT_ID_USER_TCC2_MC_3                          63 /* ID for TCC2 event user MC_3 */
#define EVENT_ID_USER_TCC2_MC_4                          64 /* ID for TCC2 event user MC_4 */
#define EVENT_ID_USER_TCC2_MC_5                          65 /* ID for TCC2 event user MC_5 */
#define EVENT_ID_USER_TCC3_EV_0                          66 /* ID for TCC3 event user EV_0 */
#define EVENT_ID_USER_TCC3_EV_1                          67 /* ID for TCC3 event user EV_1 */
#define EVENT_ID_USER_TCC3_MC_0                          68 /* ID for TCC3 event user MC_0 */
#define EVENT_ID_USER_TCC3_MC_1                          69 /* ID for TCC3 event user MC_1 */
#define EVENT_ID_USER_TCC4_EV_0                          70 /* ID for TCC4 event user EV_0 */
#define EVENT_ID_USER_TCC4_EV_1                          71 /* ID for TCC4 event user EV_1 */
#define EVENT_ID_USER_TCC4_MC_0                          72 /* ID for TCC4 event user MC_0 */
#define EVENT_ID_USER_TCC4_MC_1                          73 /* ID for TCC4 event user MC_1 */
#define EVENT_ID_USER_TCC5_EV_0                          74 /* ID for TCC5 event user EV_0 */
#define EVENT_ID_USER_TCC5_EV_1                          75 /* ID for TCC5 event user EV_1 */
#define EVENT_ID_USER_TCC5_MC_0                          76 /* ID for TCC5 event user MC_0 */
#define EVENT_ID_USER_TCC5_MC_1                          77 /* ID for TCC5 event user MC_1 */
#define EVENT_ID_USER_TCC6_EV_0                          78 /* ID for TCC6 event user EV_0 */
#define EVENT_ID_USER_TCC6_EV_1                          79 /* ID for TCC6 event user EV_1 */
#define EVENT_ID_USER_TCC6_MC_0                          80 /* ID for TCC6 event user MC_0 */
#define EVENT_ID_USER_TCC6_MC_1                          81 /* ID for TCC6 event user MC_1 */
#define EVENT_ID_USER_TCC7_EV_0                          82 /* ID for TCC7 event user EV_0 */
#define EVENT_ID_USER_TCC7_EV_1                          83 /* ID for TCC7 event user EV_1 */
#define EVENT_ID_USER_TCC7_MC_0                          84 /* ID for TCC7 event user MC_0 */
#define EVENT_ID_USER_TCC7_MC_1                          85 /* ID for TCC7 event user MC_1 */
#define EVENT_ID_USER_TCC8_EV_0                          86 /* ID for TCC8 event user EV_0 */
#define EVENT_ID_USER_TCC8_EV_1                          87 /* ID for TCC8 event user EV_1 */
#define EVENT_ID_USER_TCC8_MC_0                          88 /* ID for TCC8 event user MC_0 */
#define EVENT_ID_USER_TCC8_MC_1                          89 /* ID for TCC8 event user MC_1 */
#define EVENT_ID_USER_TCC9_EV_0                          90 /* ID for TCC9 event user EV_0 */
#define EVENT_ID_USER_TCC9_EV_1                          91 /* ID for TCC9 event user EV_1 */
#define EVENT_ID_USER_TCC9_MC_0                          92 /* ID for TCC9 event user MC_0 */
#define EVENT_ID_USER_TCC9_MC_1                          93 /* ID for TCC9 event user MC_1 */
#define EVENT_ID_USER_TCC9_MC_2                          94 /* ID for TCC9 event user MC_2 */
#define EVENT_ID_USER_TCC9_MC_3                          95 /* ID for TCC9 event user MC_3 */
#define EVENT_ID_USER_TCC9_MC_4                          96 /* ID for TCC9 event user MC_4 */
#define EVENT_ID_USER_TCC9_MC_5                          97 /* ID for TCC9 event user MC_5 */
#define EVENT_ID_USER_ADC_TRIGGERS_0                     98 /* ID for ADC event user TRIGGERS_0 */
#define EVENT_ID_USER_ADC_TRIGGERS_1                     99 /* ID for ADC event user TRIGGERS_1 */
#define EVENT_ID_USER_ADC_TRIGGERS_2                    100 /* ID for ADC event user TRIGGERS_2 */
#define EVENT_ID_USER_ADC_TRIGGERS_3                    101 /* ID for ADC event user TRIGGERS_3 */
#define EVENT_ID_USER_ADC_TRIGGERS_4                    102 /* ID for ADC event user TRIGGERS_4 */
#define EVENT_ID_USER_ADC_TRIGGERS_5                    103 /* ID for ADC event user TRIGGERS_5 */
#define EVENT_ID_USER_ADC_TRIGGERS_6                    104 /* ID for ADC event user TRIGGERS_6 */
#define EVENT_ID_USER_ADC_TRIGGERS_7                    105 /* ID for ADC event user TRIGGERS_7 */
#define EVENT_ID_USER_ADC_TRIGGERS_8                    106 /* ID for ADC event user TRIGGERS_8 */
#define EVENT_ID_USER_ADC_TRIGGERS_9                    107 /* ID for ADC event user TRIGGERS_9 */
#define EVENT_ID_USER_ADC_TRIGGERS_10                   108 /* ID for ADC event user TRIGGERS_10 */
#define EVENT_ID_USER_AC_SOC_0                          109 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                          110 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_PTC_DSEQR                         111 /* ID for PTC event user DSEQR */
#define EVENT_ID_USER_PTC_STCONV                        112 /* ID for PTC event user STCONV */
#define EVENT_ID_USER_HSM_TAMPER_0                      113 /* ID for HSM event user TAMPER_0 */
#define EVENT_ID_USER_HSM_TAMPER_1                      114 /* ID for HSM event user TAMPER_1 */
#define EVENT_ID_USER_HSM_TAMPER_2                      115 /* ID for HSM event user TAMPER_2 */
#define EVENT_ID_USER_HSM_TAMPER_3                      116 /* ID for HSM event user TAMPER_3 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CZ2051CA80144_H_ */

